
FROM python:3.8-slim-buster


# создаем каталог /app внутри контейнера и устанавливаем его в качестве
# рабочего каталога (то есть каталога, в котором будут выполняться все последующие команды).
WORKDIR /app

# Эта команда копирует содержимое текущей директории на хост-машине  в каталог контейнера /app.
ADD . /app

#Здесь Docker запускает команду pip для установки зависимостей Python из файла requirements.txt.
#Флаг --no-cache-dir используется для того, чтобы pip не хранил кэшируемые данные,
#что помогает сократить размер образа.
# Когда используется флаг -r, pip читает этот файл и устанавливает все указанные в нём пакеты и их
#зависимости.
RUN pip install --no-cache-dir -r requirements.txt

#  Разрешение на запуск скрипта
RUN chmod +x /app/start.sh

# Сделать порт 80 доступным для всего мира за пределами этого контейнера
EXPOSE 80


#CMD ["uvicorn", "main:app", "--host", "0.0.0.0", "--port", "80"]

CMD ["/app/start.sh"]
